In [113]:
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)

In [114]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [115]:
df=pd.read_csv("Attrition_dataset.csv")

In [116]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49653 entries, 0 to 49652
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   EmployeeID           49653 non-null  int64
 1   recorddate_key       49653 non-null  object
 2   birthdate_key        49653 non-null  object
 3   orighiredate_key     49653 non-null  object
 4   terminationdate_key  49653 non-null  object
 5   age                  49653 non-null  int64
 6   length_of_service    49653 non-null  int64
 7   city_name            49653 non-null  object
 8   department_name      49653 non-null  object
 9   job_title            49653 non-null  object
 10  store_name           49653 non-null  int64
 11  gender_short         49653 non-null  object
 12  gender_full          49653 non-null  object
 13  termreason_desc      49653 non-null  object
 14  termtype_desc        49653 non-null  object
 15  STATUS_YEAR          49653 non-null  int64
 16  STATUS               49653 non-null  object
 17  BUSINESS_UNIT        49653 non-null  object
dtypes: int64(5), object(13)
memory usage: 6.8+ MB

In [117]:
df.head()

,EmployeeID,recorddate_key,birthdate_key,orighiredate_key,terminationdate_key,age,length_of_service,city_name,department_name,job_title,store_name,gender_short,gender_full,termreason_desc,termtype_desc,STATUS_YEAR,STATUS,BUSINESS_UNIT
0,1318,12/31/2006 0:00,1/3/1954,8/28/1989,1/1/1900,52,17,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2006,ACTIVE,HEADOFFICE
1,1318,12/31/2007 0:00,1/3/1954,8/28/1989,1/1/1900,53,18,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2007,ACTIVE,HEADOFFICE
2,1318,12/31/2008 0:00,1/3/1954,8/28/1989,1/1/1900,54,19,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2008,ACTIVE,HEADOFFICE
3,1318,12/31/2009 0:00,1/3/1954,8/28/1989,1/1/1900,55,20,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2009,ACTIVE,HEADOFFICE
4,1318,12/31/2010 0:00,1/3/1954,8/28/1989,1/1/1900,56,21,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2010,ACTIVE,HEADOFFICE

In [118]:
df.duplicated().any()

False

# data cleaning

In [119]:
df.duplicated(subset='EmployeeID').any()

True

In [120]:
df=df.drop_duplicates(subset='EmployeeID',keep='last').reset_index(drop=True)

In [121]:
df

,EmployeeID,recorddate_key,birthdate_key,orighiredate_key,terminationdate_key,age,length_of_service,city_name,department_name,job_title,store_name,gender_short,gender_full,termreason_desc,termtype_desc,STATUS_YEAR,STATUS,BUSINESS_UNIT
0,1318,12/31/2015 0:00,1/3/1954,8/28/1989,1/1/1900,61,26,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2015,ACTIVE,HEADOFFICE
1,1319,12/31/2015 0:00,1/3/1957,8/28/1989,1/1/1900,58,26,Vancouver,Executive,VP Stores,35,F,Female,Not Applicable,Not Applicable,2015,ACTIVE,HEADOFFICE
2,1320,12/31/2015 0:00,1/2/1955,8/28/1989,1/1/1900,60,26,Vancouver,Executive,Legal Counsel,35,F,Female,Not Applicable,Not Applicable,2015,ACTIVE,HEADOFFICE
3,1321,12/31/2015 0:00,1/2/1959,8/28/1989,1/1/1900,56,26,Vancouver,Executive,VP Human Resources,35,M,Male,Not Applicable,Not Applicable,2015,ACTIVE,HEADOFFICE
4,1322,12/31/2015 0:00,1/9/1958,8/31/1989,1/1/1900,57,26,Vancouver,Executive,VP Finance,35,M,Male,Not Applicable,Not Applicable,2015,ACTIVE,HEADOFFICE
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6279,8258,12/1/2015 0:00,5/28/1994,8/19/2013,12/30/2015,21,2,Valemount,Dairy,Dairy Person,34,M,Male,Layoff,Involuntary,2015,TERMINATED,STORES
6280,8264,8/1/2013 0:00,6/13/1994,8/27/2013,8/30/2013,19,0,Vancouver,Customer Service,Cashier,44,F,Female,Resignaton,Voluntary,2013,TERMINATED,STORES
6281,8279,12/1/2015 0:00,7/18/1994,9/15/2013,12/30/2015,21,2,White Rock,Customer Service,Cashier,39,F,Female,Layoff,Involuntary,2015,TERMINATED,STORES
6282,8296,12/1/2013 0:00,9/2/1994,10/9/2013,12/31/2013,19,0,Kelowna,Customer Service,Cashier,16,F,Female,Resignaton,Voluntary,2013,TERMINATED,STORES
6283,8321,12/1/2014 0:00,11/28/1994,11/24/2013,12/30/2014,20,1,Grand Forks,Customer Service,Cashier,13,F,Female,Layoff,Involuntary,2014,TERMINATED,STORES

In [122]:
df.columns

Index(['EmployeeID', 'recorddate_key', 'birthdate_key', 'orighiredate_key',
       'terminationdate_key', 'age', 'length_of_service', 'city_name',
       'department_name', 'job_title', 'store_name', 'gender_short',
       'gender_full', 'termreason_desc', 'termtype_desc', 'STATUS_YEAR',
       'STATUS', 'BUSINESS_UNIT'],
      dtype='object')

In [123]:
for col in df.columns[[1,2,3,4]]:
    df[col]=pd.to_datetime(df[col])

In [124]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6284 entries, 0 to 6283
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   EmployeeID           6284 non-null   int64
 1   recorddate_key       6284 non-null   datetime64[ns]
 2   birthdate_key        6284 non-null   datetime64[ns]
 3   orighiredate_key     6284 non-null   datetime64[ns]
 4   terminationdate_key  6284 non-null   datetime64[ns]
 5   age                  6284 non-null   int64
 6   length_of_service    6284 non-null   int64
 7   city_name            6284 non-null   object
 8   department_name      6284 non-null   object
 9   job_title            6284 non-null   object
 10  store_name           6284 non-null   int64
 11  gender_short         6284 non-null   object
 12  gender_full          6284 non-null   object
 13  termreason_desc      6284 non-null   object
 14  termtype_desc        6284 non-null   object
 15  STATUS_YEAR          6284 non-null   int64
 16  STATUS               6284 non-null   object
 17  BUSINESS_UNIT        6284 non-null   object
dtypes: datetime64[ns](4), int64(5), object(9)
memory usage: 883.8+ KB

# data transformation

In [125]:
df['store_name'].unique()

array([35, 32, 18, 43, 29, 16, 26, 15,  8, 36, 38, 21, 44,  5, 25, 17, 28,
        1, 30,  2, 22, 31, 41,  6, 46, 40, 33, 12,  3, 19, 42, 37,  9,  7,
       13, 45, 39, 20, 11, 14, 34, 23, 24, 27, 10,  4], dtype=int64)

In [126]:
df=df.drop(columns=['store_name','gender_short'])

In [127]:
df

,EmployeeID,recorddate_key,birthdate_key,orighiredate_key,terminationdate_key,age,length_of_service,city_name,department_name,job_title,gender_full,termreason_desc,termtype_desc,STATUS_YEAR,STATUS,BUSINESS_UNIT
0,1318,2015-12-31,1954-01-03,1989-08-28,1900-01-01,61,26,Vancouver,Executive,CEO,Male,Not Applicable,Not Applicable,2015,ACTIVE,HEADOFFICE
1,1319,2015-12-31,1957-01-03,1989-08-28,1900-01-01,58,26,Vancouver,Executive,VP Stores,Female,Not Applicable,Not Applicable,2015,ACTIVE,HEADOFFICE
2,1320,2015-12-31,1955-01-02,1989-08-28,1900-01-01,60,26,Vancouver,Executive,Legal Counsel,Female,Not Applicable,Not Applicable,2015,ACTIVE,HEADOFFICE
3,1321,2015-12-31,1959-01-02,1989-08-28,1900-01-01,56,26,Vancouver,Executive,VP Human Resources,Male,Not Applicable,Not Applicable,2015,ACTIVE,HEADOFFICE
4,1322,2015-12-31,1958-01-09,1989-08-31,1900-01-01,57,26,Vancouver,Executive,VP Finance,Male,Not Applicable,Not Applicable,2015,ACTIVE,HEADOFFICE
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6279,8258,2015-12-01,1994-05-28,2013-08-19,2015-12-30,21,2,Valemount,Dairy,Dairy Person,Male,Layoff,Involuntary,2015,TERMINATED,STORES
6280,8264,2013-08-01,1994-06-13,2013-08-27,2013-08-30,19,0,Vancouver,Customer Service,Cashier,Female,Resignaton,Voluntary,2013,TERMINATED,STORES
6281,8279,2015-12-01,1994-07-18,2013-09-15,2015-12-30,21,2,White Rock,Customer Service,Cashier,Female,Layoff,Involuntary,2015,TERMINATED,STORES
6282,8296,2013-12-01,1994-09-02,2013-10-09,2013-12-31,19,0,Kelowna,Customer Service,Cashier,Female,Resignaton,Voluntary,2013,TERMINATED,STORES
6283,8321,2014-12-01,1994-11-28,2013-11-24,2014-12-30,20,1,Grand Forks,Customer Service,Cashier,Female,Layoff,Involuntary,2014,TERMINATED,STORES

In [128]:
df.columns

Index(['EmployeeID', 'recorddate_key', 'birthdate_key', 'orighiredate_key',
       'terminationdate_key', 'age', 'length_of_service', 'city_name',
       'department_name', 'job_title', 'gender_full', 'termreason_desc',
       'termtype_desc', 'STATUS_YEAR', 'STATUS', 'BUSINESS_UNIT'],
      dtype='object')

In [129]:
df.columns=['Eid','Record Date','DOB','Hire Date','Term Date','Age','Experience','City','Dname','Job','Gender','Term Reason','Term Type','Status Year','Status','Business Unit']

In [130]:
df

,Eid,Record Date,DOB,Hire Date,Term Date,Age,Experience,City,Dname,Job,Gender,Term Reason,Term Type,Status Year,Status,Business Unit
0,1318,2015-12-31,1954-01-03,1989-08-28,1900-01-01,61,26,Vancouver,Executive,CEO,Male,Not Applicable,Not Applicable,2015,ACTIVE,HEADOFFICE
1,1319,2015-12-31,1957-01-03,1989-08-28,1900-01-01,58,26,Vancouver,Executive,VP Stores,Female,Not Applicable,Not Applicable,2015,ACTIVE,HEADOFFICE
2,1320,2015-12-31,1955-01-02,1989-08-28,1900-01-01,60,26,Vancouver,Executive,Legal Counsel,Female,Not Applicable,Not Applicable,2015,ACTIVE,HEADOFFICE
3,1321,2015-12-31,1959-01-02,1989-08-28,1900-01-01,56,26,Vancouver,Executive,VP Human Resources,Male,Not Applicable,Not Applicable,2015,ACTIVE,HEADOFFICE
4,1322,2015-12-31,1958-01-09,1989-08-31,1900-01-01,57,26,Vancouver,Executive,VP Finance,Male,Not Applicable,Not Applicable,2015,ACTIVE,HEADOFFICE
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6279,8258,2015-12-01,1994-05-28,2013-08-19,2015-12-30,21,2,Valemount,Dairy,Dairy Person,Male,Layoff,Involuntary,2015,TERMINATED,STORES
6280,8264,2013-08-01,1994-06-13,2013-08-27,2013-08-30,19,0,Vancouver,Customer Service,Cashier,Female,Resignaton,Voluntary,2013,TERMINATED,STORES
6281,8279,2015-12-01,1994-07-18,2013-09-15,2015-12-30,21,2,White Rock,Customer Service,Cashier,Female,Layoff,Involuntary,2015,TERMINATED,STORES
6282,8296,2013-12-01,1994-09-02,2013-10-09,2013-12-31,19,0,Kelowna,Customer Service,Cashier,Female,Resignaton,Voluntary,2013,TERMINATED,STORES
6283,8321,2014-12-01,1994-11-28,2013-11-24,2014-12-30,20,1,Grand Forks,Customer Service,Cashier,Female,Layoff,Involuntary,2014,TERMINATED,STORES

In [131]:
for col in ['Status','Business Unit']:
    df[col]=df[col].str.title()

In [132]:
df.head()

,Eid,Record Date,DOB,Hire Date,Term Date,Age,Experience,City,Dname,Job,Gender,Term Reason,Term Type,Status Year,Status,Business Unit
0,1318,2015-12-31,1954-01-03,1989-08-28,1900-01-01,61,26,Vancouver,Executive,CEO,Male,Not Applicable,Not Applicable,2015,Active,Headoffice
1,1319,2015-12-31,1957-01-03,1989-08-28,1900-01-01,58,26,Vancouver,Executive,VP Stores,Female,Not Applicable,Not Applicable,2015,Active,Headoffice
2,1320,2015-12-31,1955-01-02,1989-08-28,1900-01-01,60,26,Vancouver,Executive,Legal Counsel,Female,Not Applicable,Not Applicable,2015,Active,Headoffice
3,1321,2015-12-31,1959-01-02,1989-08-28,1900-01-01,56,26,Vancouver,Executive,VP Human Resources,Male,Not Applicable,Not Applicable,2015,Active,Headoffice
4,1322,2015-12-31,1958-01-09,1989-08-31,1900-01-01,57,26,Vancouver,Executive,VP Finance,Male,Not Applicable,Not Applicable,2015,Active,Headoffice

In [133]:
df.loc[df['Status']=='Active','Term Date'].unique()

<DatetimeArray>
['1900-01-01 00:00:00']
Length: 1, dtype: datetime64[ns]

In [134]:
df.loc[df['Status']=='Active','Record Date'].unique()

<DatetimeArray>
['2015-12-31 00:00:00']
Length: 1, dtype: datetime64[ns]

In [135]:
df['Record Date'].unique()

<DatetimeArray>
['2015-12-31 00:00:00', '2009-02-01 00:00:00', '2014-02-01 00:00:00',
 '2014-03-01 00:00:00', '2009-03-01 00:00:00', '2012-09-01 00:00:00',
 '2014-04-01 00:00:00', '2009-04-01 00:00:00', '2009-05-01 00:00:00',
 '2014-05-01 00:00:00',
 ...
 '2013-03-01 00:00:00', '2013-04-01 00:00:00', '2013-05-01 00:00:00',
 '2013-06-01 00:00:00', '2013-07-01 00:00:00', '2013-08-01 00:00:00',
 '2013-09-01 00:00:00', '2013-11-01 00:00:00', '2013-12-01 00:00:00',
 '2014-01-01 00:00:00']
Length: 121, dtype: datetime64[ns]

In [136]:
df.loc[df['Status']=='Active','Term Date']=df.loc[df['Status']=='Active','Record Date']

In [137]:
df.head()

,Eid,Record Date,DOB,Hire Date,Term Date,Age,Experience,City,Dname,Job,Gender,Term Reason,Term Type,Status Year,Status,Business Unit
0,1318,2015-12-31,1954-01-03,1989-08-28,2015-12-31,61,26,Vancouver,Executive,CEO,Male,Not Applicable,Not Applicable,2015,Active,Headoffice
1,1319,2015-12-31,1957-01-03,1989-08-28,2015-12-31,58,26,Vancouver,Executive,VP Stores,Female,Not Applicable,Not Applicable,2015,Active,Headoffice
2,1320,2015-12-31,1955-01-02,1989-08-28,2015-12-31,60,26,Vancouver,Executive,Legal Counsel,Female,Not Applicable,Not Applicable,2015,Active,Headoffice
3,1321,2015-12-31,1959-01-02,1989-08-28,2015-12-31,56,26,Vancouver,Executive,VP Human Resources,Male,Not Applicable,Not Applicable,2015,Active,Headoffice
4,1322,2015-12-31,1958-01-09,1989-08-31,2015-12-31,57,26,Vancouver,Executive,VP Finance,Male,Not Applicable,Not Applicable,2015,Active,Headoffice

In [138]:
temp=df['Dname'].unique()
print(temp)
temp[0]

['Executive' 'Store Management' 'Meats' 'Recruitment' 'Customer Service'
 'Produce' 'Bakery' 'Dairy' 'Processed Foods' 'Training' 'Labor Relations'
 'HR Technology' 'Employee Records' 'Compensation' 'Legal'
 'Accounts Receiveable' 'Information Technology' 'Accounts Payable'
 'Audit' 'Accounting' 'Investment']

'Executive'

In [139]:
df.loc[df['Dname']==temp[0],['Dname','Job','Business Unit']]

        Dname                              Job Business Unit
0   Executive                              CEO    Headoffice
1   Executive                        VP Stores    Headoffice
2   Executive                    Legal Counsel    Headoffice
3   Executive               VP Human Resources    Headoffice
4   Executive                       VP Finance    Headoffice
5   Executive        Exec Assistant, VP Stores    Headoffice
6   Executive    Exec Assistant, Legal Counsel    Headoffice
7   Executive        CHief Information Officer    Headoffice
11  Executive  Exec Assistant, Human Resources    Headoffice
12  Executive          Exec Assistant, Finance    Headoffice

In [140]:
def multi_val(row):
    if row['Job'].startswith('Exec Assistant,'):
        return row['Job'].removeprefix('Exec Assistant,').strip()
    else:
        return row['Job']
    
df['Job']=df.apply(multi_val,axis=1)

In [141]:
df.loc[df['Dname']==temp[0],['Dname','Job','Business Unit']]

        Dname                        Job Business Unit
0   Executive                        CEO    Headoffice
1   Executive                  VP Stores    Headoffice
2   Executive              Legal Counsel    Headoffice
3   Executive         VP Human Resources    Headoffice
4   Executive                 VP Finance    Headoffice
5   Executive                  VP Stores    Headoffice
6   Executive              Legal Counsel    Headoffice
7   Executive  CHief Information Officer    Headoffice
11  Executive            Human Resources    Headoffice
12  Executive                    Finance    Headoffice

In [142]:
df.loc[df['Dname']==temp[1],['Dname','Job','Business Unit']]

                 Dname            Job Business Unit
8     Store Management  Store Manager        Stores
10    Store Management  Store Manager        Stores
32    Store Management  Store Manager        Stores
47    Store Management  Store Manager        Stores
4800  Store Management  Store Manager        Stores
4801  Store Management  Store Manager        Stores
4803  Store Management  Store Manager        Stores
4809  Store Management  Store Manager        Stores
4817  Store Management  Store Manager        Stores
4819  Store Management  Store Manager        Stores
4829  Store Management  Store Manager        Stores
4833  Store Management  Store Manager        Stores
4835  Store Management  Store Manager        Stores
4843  Store Management  Store Manager        Stores
4855  Store Management  Store Manager        Stores
4856  Store Management  Store Manager        Stores
4857  Store Management  Store Manager        Stores
4866  Store Management  Store Manager        Stores
4869  Store Management  Store Manager        Stores
4891  Store Management  Store Manager        Stores
4893  Store Management  Store Manager        Stores
4903  Store Management  Store Manager        Stores
4911  Store Management  Store Manager        Stores
4913  Store Management  Store Manager        Stores
4974  Store Management  Store Manager        Stores
4978  Store Management  Store Manager        Stores
4979  Store Management  Store Manager        Stores
4993  Store Management  Store Manager        Stores
4995  Store Management  Store Manager        Stores
5012  Store Management  Store Manager        Stores
5030  Store Management  Store Manager        Stores
5041  Store Management  Store Manager        Stores
5045  Store Management  Store Manager        Stores
5049  Store Management  Store Manager        Stores
5102  Store Management  Store Manager        Stores

In [143]:
def multi_val(row):
    if row['Job'].startswith('Exec Assistant,'):
        return row['Job'].removeprefix('Exec Assistant,').strip()
    elif row['Job'].startswith('Store'):
        return row['Job'].removeprefix('Store').strip()
    else:
        return row['Job']
    
df['Job']=df.apply(multi_val,axis=1)

In [144]:
df.loc[df['Dname']==temp[1],['Dname','Job','Business Unit']]

                 Dname      Job Business Unit
8     Store Management  Manager        Stores
10    Store Management  Manager        Stores
32    Store Management  Manager        Stores
47    Store Management  Manager        Stores
4800  Store Management  Manager        Stores
4801  Store Management  Manager        Stores
4803  Store Management  Manager        Stores
4809  Store Management  Manager        Stores
4817  Store Management  Manager        Stores
4819  Store Management  Manager        Stores
4829  Store Management  Manager        Stores
4833  Store Management  Manager        Stores
4835  Store Management  Manager        Stores
4843  Store Management  Manager        Stores
4855  Store Management  Manager        Stores
4856  Store Management  Manager        Stores
4857  Store Management  Manager        Stores
4866  Store Management  Manager        Stores
4869  Store Management  Manager        Stores
4891  Store Management  Manager        Stores
4893  Store Management  Manager        Stores
4903  Store Management  Manager        Stores
4911  Store Management  Manager        Stores
4913  Store Management  Manager        Stores
4974  Store Management  Manager        Stores
4978  Store Management  Manager        Stores
4979  Store Management  Manager        Stores
4993  Store Management  Manager        Stores
4995  Store Management  Manager        Stores
5012  Store Management  Manager        Stores
5030  Store Management  Manager        Stores
5041  Store Management  Manager        Stores
5045  Store Management  Manager        Stores
5049  Store Management  Manager        Stores
5102  Store Management  Manager        Stores

In [145]:
df.loc[df['Dname']==temp[2],['Dname','Job','Business Unit']]

      Dname            Job Business Unit
9     Meats  Meats Manager        Stores
14    Meats  Meats Manager        Stores
15    Meats  Meats Manager        Stores
16    Meats    Meat Cutter        Stores
20    Meats    Meat Cutter        Stores
...     ...            ...           ...
6065  Meats    Meat Cutter        Stores
6073  Meats    Meat Cutter        Stores
6081  Meats    Meat Cutter        Stores
6085  Meats    Meat Cutter        Stores
6127  Meats    Meat Cutter        Stores

[1252 rows x 3 columns]

In [146]:
def multi_val(row):
    if row['Job'].startswith('Exec Assistant,'):
        return row['Job'].removeprefix('Exec Assistant,').strip()
    elif row['Job'].startswith('Store'):
        return row['Job'].removeprefix('Store').strip()
    elif row['Job'].startswith('Meats'):
        return row['Job'].removeprefix('Meats').strip()
    else:
        return row['Job']
    
df['Job']=df.apply(multi_val,axis=1)

In [147]:
df.loc[df['Dname']==temp[2],['Dname','Job','Business Unit']]

      Dname          Job Business Unit
9     Meats      Manager        Stores
14    Meats      Manager        Stores
15    Meats      Manager        Stores
16    Meats  Meat Cutter        Stores
20    Meats  Meat Cutter        Stores
...     ...          ...           ...
6065  Meats  Meat Cutter        Stores
6073  Meats  Meat Cutter        Stores
6081  Meats  Meat Cutter        Stores
6085  Meats  Meat Cutter        Stores
6127  Meats  Meat Cutter        Stores

[1252 rows x 3 columns]

In [148]:
df.loc[df['Dname']==temp[2],'Job'].unique()

array(['Manager', 'Meat Cutter'], dtype=object)

In [149]:
df.loc[df['Dname']==temp[3],['Dname','Job','Business Unit']]

            Dname                    Job Business Unit
13    Recruitment  Director, Recruitment    Headoffice
4826  Recruitment              Recruiter    Headoffice
4827  Recruitment              Recruiter    Headoffice
4828  Recruitment              Recruiter    Headoffice
4830  Recruitment              Recruiter    Headoffice
4834  Recruitment              Recruiter    Headoffice
4836  Recruitment              Recruiter    Headoffice
4838  Recruitment              Recruiter    Headoffice
4842  Recruitment              Recruiter    Headoffice

In [150]:
def multi_val(row):
    if row['Job'].startswith('Exec Assistant,'):
        return row['Job'].removeprefix('Exec Assistant,').strip()
    elif row['Job'].startswith('Store'):
        return row['Job'].removeprefix('Store').strip()
    elif row['Job'].startswith('Meats'):
        return row['Job'].removeprefix('Meats').strip()
    elif row['Job'].startswith('Director'):
        return 'Director'
    
    
    else:
        return row['Job']
    
df['Job']=df.apply(multi_val,axis=1)

In [151]:
df.loc[df['Dname']==temp[3],['Dname','Job','Business Unit']]

            Dname        Job Business Unit
13    Recruitment   Director    Headoffice
4826  Recruitment  Recruiter    Headoffice
4827  Recruitment  Recruiter    Headoffice
4828  Recruitment  Recruiter    Headoffice
4830  Recruitment  Recruiter    Headoffice
4834  Recruitment  Recruiter    Headoffice
4836  Recruitment  Recruiter    Headoffice
4838  Recruitment  Recruiter    Headoffice
4842  Recruitment  Recruiter    Headoffice

In [152]:
df.loc[df['Dname']==temp[4],['Dname','Job','Business Unit']]

                 Dname                       Job Business Unit
17    Customer Service  Customer Service Manager        Stores
30    Customer Service  Customer Service Manager        Stores
31    Customer Service  Customer Service Manager        Stores
54    Customer Service  Customer Service Manager        Stores
61    Customer Service  Customer Service Manager        Stores
...                ...                       ...           ...
6278  Customer Service                   Cashier        Stores
6280  Customer Service                   Cashier        Stores
6281  Customer Service                   Cashier        Stores
6282  Customer Service                   Cashier        Stores
6283  Customer Service                   Cashier        Stores

[1190 rows x 3 columns]

In [153]:
def multi_val(row):
    if row['Job'].startswith('Exec Assistant,'):
        return row['Job'].removeprefix('Exec Assistant,').strip()
    
    elif row['Job'].endswith('Manager'):
        return 'Manger'
    
    elif row['Job'].startswith('Meats'):
        return row['Job'].removeprefix('Meats').strip()
    
    elif row['Job'].startswith('Director'):
        return 'Director'
    
    
    else:
        return row['Job']
    
df['Job']=df.apply(multi_val,axis=1)

In [154]:
df.loc[df['Dname']==temp[4],['Dname','Job','Business Unit']]

                 Dname      Job Business Unit
17    Customer Service   Manger        Stores
30    Customer Service   Manger        Stores
31    Customer Service   Manger        Stores
54    Customer Service   Manger        Stores
61    Customer Service   Manger        Stores
...                ...      ...           ...
6278  Customer Service  Cashier        Stores
6280  Customer Service  Cashier        Stores
6281  Customer Service  Cashier        Stores
6282  Customer Service  Cashier        Stores
6283  Customer Service  Cashier        Stores

[1190 rows x 3 columns]

In [155]:
df.loc[df['Dname']==temp[5],['Dname','Job','Business Unit']]

        Dname            Job Business Unit
18    Produce         Manger        Stores
19    Produce         Manger        Stores
38    Produce         Manger        Stores
45    Produce         Manger        Stores
57    Produce         Manger        Stores
...       ...            ...           ...
5918  Produce  Produce Clerk        Stores
6021  Produce  Produce Clerk        Stores
6108  Produce  Produce Clerk        Stores
6112  Produce  Produce Clerk        Stores
6275  Produce  Produce Clerk        Stores

[1060 rows x 3 columns]

In [156]:
def multi_val(row):
    if row['Job'].startswith('Exec Assistant,'):
        return row['Job'].removeprefix('Exec Assistant,').strip()
    
    elif row['Job'].endswith('Manager'):
        return 'Manger'
    
    elif row['Job'].endswith('Clerk'):
        return 'Clerk'
    
    elif row['Job'].startswith('Meats'):
        return row['Job'].removeprefix('Meats').strip()
    
    elif row['Job'].startswith('Director'):
        return 'Director'
    
    
    else:
        return row['Job']
    
df['Job']=df.apply(multi_val,axis=1)

In [157]:
df.loc[df['Dname']==temp[5],['Dname','Job','Business Unit']]

        Dname     Job Business Unit
18    Produce  Manger        Stores
19    Produce  Manger        Stores
38    Produce  Manger        Stores
45    Produce  Manger        Stores
57    Produce  Manger        Stores
...       ...     ...           ...
5918  Produce   Clerk        Stores
6021  Produce   Clerk        Stores
6108  Produce   Clerk        Stores
6112  Produce   Clerk        Stores
6275  Produce   Clerk        Stores

[1060 rows x 3 columns]

In [158]:
df.loc[df['Dname']==temp[10],['Dname','Job','Business Unit']]

                Dname                      Job Business Unit
4802  Labor Relations                 Director    Headoffice
4871  Labor Relations  Labor Relations Analyst    Headoffice
4876  Labor Relations  Labor Relations Analyst    Headoffice
4877  Labor Relations  Labor Relations Analyst    Headoffice
4881  Labor Relations  Labor Relations Analyst    Headoffice
4883  Labor Relations  Labor Relations Analyst    Headoffice

In [159]:
df.loc[df['Dname']==temp[10],'Job'].unique()

array(['Director', 'Labor Relations Analyst'], dtype=object)

In [160]:
def multi_val(row):
    if row['Job'].startswith('Exec Assistant,'):
        return row['Job'].removeprefix('Exec Assistant,').strip()
    
    elif row['Job'].endswith('Manager'):
        return 'Manger'
    
    elif row['Job'].endswith('Clerk'):
        return 'Clerk'
        
    elif row['Job'].endswith('Analyst'):
        return 'Analyst'
    
            
    elif row['Job'].endswith('Admin'):
        return 'Admin'
    
    
    elif row['Job'].startswith('Meats'):
        return row['Job'].removeprefix('Meats').strip()
    
    elif row['Job'].startswith('Director'):
        return 'Director'
    
    
    
    else:
        return row['Job']
    
df['Job']=df.apply(multi_val,axis=1)

In [161]:
df.loc[df['Dname']==temp[12],'Job'].unique()

array(['Director', 'Admin'], dtype=object)

In [162]:
df.loc[df['Dname']==temp[12],['Dname','Job','Business Unit']]

                 Dname       Job Business Unit
4805  Employee Records  Director    Headoffice
4898  Employee Records     Admin    Headoffice
4900  Employee Records     Admin    Headoffice
4907  Employee Records     Admin    Headoffice
4908  Employee Records     Admin    Headoffice
4910  Employee Records     Admin    Headoffice

In [163]:
def multi_val(row):
    if row['Job'].startswith('Exec Assistant,'):
        return row['Job'].removeprefix('Exec Assistant,').strip()
    
    elif row['Job'].endswith('Manager'):
        return 'Manger'
    
    elif row['Job'].endswith('Clerk'):
        return 'Clerk'
        
    elif row['Job'].endswith('Analyst'):
        return 'Analyst'
    
            
    elif row['Job'].endswith('Admin'):
        return 'Admin'
    
    
    elif row['Job'].startswith('Meats'):
        return row['Job'].removeprefix('Meats').strip()
    
    elif row['Job'].startswith('Director'):
        return 'Director'
    
    
    
    else:
        return row['Job']
    
df['Job']=df.apply(multi_val,axis=1)

In [164]:
df.loc[df['Dname']==temp[18],'Job'].unique()

array(['Director', 'Auditor'], dtype=object)

In [165]:
df.loc[df['Dname']==temp[20],['Dname','Job','Business Unit']]

           Dname       Job Business Unit
4824  Investment  Director    Headoffice
4969  Investment   Analyst    Headoffice
4970  Investment   Analyst    Headoffice
4971  Investment   Analyst    Headoffice

In [166]:
df['Job']=df['Job'].replace({'CHief Information Officer':'Chief Information Officer'})